--- phantom-core/src/sample_math.rs
+++ replace multiply -> i32 with 0
@@ -1,14 +1,14 @@
 pub fn add(a: i32, b: i32) -> i32 {
     a + b
 }
 
 pub fn multiply(a: i32, b: i32) -> i32 {
-    a * b
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_add() {
