--- phantom-core/src/toast_notification.rs
+++ delete field cbSize from struct NOTIFYICONDATAW expression in win_balloon::show_balloon
@@ -122,17 +122,17 @@
         let Ok(mut guard) = state.lock() else { return; };
         let hwnd = guard.hwnd;
         if hwnd == HWND::default() { return; }
 
         unsafe {
             let h_icon = LoadIconW(HINSTANCE::default(), IDI_APPLICATION).unwrap_or_default();
 
             let mut nid = NOTIFYICONDATAW {
-                cbSize: std::mem::size_of::<NOTIFYICONDATAW>() as u32,
+                 /* ~ changed by cargo-mutants ~ */
                 hWnd: hwnd,
                 uID: 1,
                 uFlags: NIF_ICON | NIF_MESSAGE | NIF_TIP | NIF_INFO,
                 uCallbackMessage: WM_TRAYICON,
                 hIcon: h_icon,
                 szTip: encode_wide::<128>("Kairo Phantom"),
                 szInfo: encode_wide::<256>(message),
                 szInfoTitle: encode_wide::<64>(title),
