--- phantom-core/src/toast_notification.rs
+++ delete field hWnd from struct NOTIFYICONDATAW expression in win_balloon::show_balloon
@@ -123,17 +123,17 @@
         let hwnd = guard.hwnd;
         if hwnd == HWND::default() { return; }
 
         unsafe {
             let h_icon = LoadIconW(HINSTANCE::default(), IDI_APPLICATION).unwrap_or_default();
 
             let mut nid = NOTIFYICONDATAW {
                 cbSize: std::mem::size_of::<NOTIFYICONDATAW>() as u32,
-                hWnd: hwnd,
+                 /* ~ changed by cargo-mutants ~ */
                 uID: 1,
                 uFlags: NIF_ICON | NIF_MESSAGE | NIF_TIP | NIF_INFO,
                 uCallbackMessage: WM_TRAYICON,
                 hIcon: h_icon,
                 szTip: encode_wide::<128>("Kairo Phantom"),
                 szInfo: encode_wide::<256>(message),
                 szInfoTitle: encode_wide::<64>(title),
                 Anonymous: NOTIFYICONDATAW_0::default(),
