--- phantom-core/src/toast_notification.rs
+++ delete field lpfnWndProc from struct WNDCLASSW expression in win_balloon::create_hidden_hwnd
@@ -82,17 +82,17 @@
     }
 
     fn create_hidden_hwnd() -> HWND {
         unsafe {
             let class_name = encode_wide::<64>("KairoPhantomTrayClass");
 
             let wc = WNDCLASSW {
                 style: CS_HREDRAW | CS_VREDRAW,
-                lpfnWndProc: Some(wnd_proc),
+                 /* ~ changed by cargo-mutants ~ */
                 hInstance: HINSTANCE::default(),
                 lpszClassName: PCWSTR(class_name.as_ptr()),
                 ..Default::default()
             };
             RegisterClassW(&wc);
 
             CreateWindowExW(
                 WINDOW_EX_STYLE::default(),
