--- phantom-core/src/governance/tool_gate.rs
+++ replace ToolGate::add_allowed_path with ()
@@ -22,17 +22,17 @@
         
         Self {
             allowed_paths: allowed,
             token_cap: 5000,
         }
     }
 
     pub fn add_allowed_path(&mut self, path: String) {
-        self.allowed_paths.insert(path);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn validate_file_access(&self, path: &str) -> bool {
         // Enforce: Never write to C:\Windows or /etc
         if path.to_lowercase().starts_with("c:\\windows") || path.starts_with("/etc") {
             warn!("🚨 ToolGate: Blocked LLM attempt to access system directory: {}", path);
             return false;
         }
