--- phantom-core/src/governance/tool_gate.rs
+++ delete ! in ToolGate::validate_file_access
@@ -34,17 +34,17 @@
         // Enforce: Never write to C:\Windows or /etc
         if path.to_lowercase().starts_with("c:\\windows") || path.starts_with("/etc") {
             warn!("🚨 ToolGate: Blocked LLM attempt to access system directory: {}", path);
             return false;
         }
 
         // Must be in allowed paths
         let is_allowed = self.allowed_paths.iter().any(|allowed| path.starts_with(allowed));
-        if !is_allowed {
+        if  /* ~ changed by cargo-mutants ~ */is_allowed {
             warn!("🚨 ToolGate: Blocked access to unapproved path: {}", path);
             return false;
         }
         true
     }
 
     pub fn validate_token_usage(&self, tokens_requested: usize) -> bool {
         if tokens_requested > self.token_cap {
